/*=========================< begin file & file header >=======================
 *  References
 *  
 *    filename : adc3112.c
 *    author   : JFG
 *    company  : IOxOS
 *    creation : June 11,2014
 *    version  : 0.0.1
 *
 *----------------------------------------------------------------------------
 *  Description
 *
 *     That file contains a set of function called by XprsMon to cotrol an
 *     ADC3112 FMC.
 *
 *----------------------------------------------------------------------------
 *  Copyright Notice
 *  
 *    Copyright and all other rights in this document are reserved by 
 *    IOxOS Technologies SA. This documents contains proprietary information    
 *    and is supplied on express condition that it may not be disclosed, 
 *    reproduced in whole or in part, or used for any other purpose other
 *    than that for which it is supplies, without the written consent of  
 *    IOxOS Technologies SA                                                        
 *
 *=============================< end file header >============================*/

#ifndef lint
static char *rcsid = "$Id: adc3112.c,v 1.10 2016/01/15 10:21:19 ioxos Exp $";
#endif

#define DEBUGno
#include <debug.h>

#include <sys/types.h>
#include <sys/time.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include <time.h>
#include <cli.h>
#include <unistd.h>
#include "../../include/tscextlib.h"
#include <tscioctl.h>
#include <tsculib.h>

#define BUS_SPI   0x01
#define BUS_I2C   0x02
#define BUS_SBC   0x03
#define BUS_READ  0x10
#define BUS_WRITE 0x20

#define MAP_OLDno

#define ADC_REG_BMOV_A        0x1100
#define ADC_REG_BMOV_B        0x1110
#define ACQ_REG_BASE_A        0x11c0
#define ACQ_REG_BASE_B        0x11d0
#define ACQ_REG_BASE_1        0x11c0
#define ACQ_REG_BASE_2        0x11d0

#define ADC_REG_SIGN_A       0x1200
#define ADC_REG_SIGN_B       0x1300

#define ADC_REG_SERIAL_A     0x120c
#define ADC_REG_SERIAL_B     0x130c


#define ADC_REG_GAIN_A        0x1220
#define ADC_REG_GAIN_B        0x1320

#define ADC_REG_TTIM_A         0x1230
#define ADC_REG_TTIM_B         0x1330

#define ADS_REG_TEMP 0x2b

#define ADC_NUM_SAMPLES       0x8000                /* 32k samples */
#define ADC_SAMPLE_SIZE       sizeof(short)

#define CAL_ALL_BIT  0x8000
#define CAL_STEP_NUM 40
#define CAL_BIT_NUM  16
#define CAL_STEP_WIDTH  78.125
#define NUM_FMC 2
#define ADC_NUM_CHAN 4
#define ADC_OFF_CHAN_0  0x00000
#define ADC_OFF_CHAN_1  (ADC_OFF_CHAN_0 + (ADC_NUM_SAMPLES*ADC_SAMPLE_SIZE))
#define ADC_OFF_CHAN_2  (ADC_OFF_CHAN_0 + (2*ADC_OFF_CHAN_1))
#define ADC_OFF_CHAN_3  (ADC_OFF_CHAN_0 + (3*ADC_OFF_CHAN_1))

#define ADC_ADS01_CMD     0x01000000
#define ADC_ADS23_CMD     0x01010000
#define ADC_XRA01_CMD     0x01020000
#define ADC_XRA23_CMD     0x01030000
#define ADC_LMK_CMD       0x02000000
#define ADC_SY_CMD        0x02010000
#define ADC_DAC_CMD       0x03000000
#define ADC_XRATRIG_CMD   0x03010000
#define ADC_EEPROM_CMD    0x01010051
#define FMC_IDX(fmc)      (fmc-1)
struct tsc_adc3112_devices
{
  char *name;
  uint cmd;
  int idx;
  int bus;
}
adc3112_devices[] =
{
  { "ads01",   0x01000000, 0, BUS_SPI|BUS_READ|BUS_WRITE},
  { "ads1",    0x01000000, 0, BUS_SPI|BUS_READ|BUS_WRITE},
  { "ads23",   0x01010000, 1, BUS_SPI|BUS_READ|BUS_WRITE},
  { "ads2",    0x01010000, 1, BUS_SPI|BUS_READ|BUS_WRITE},
  { "ads",     0x00000000, -1, 0},
  { "ads0123", 0x00000000, -1, 0},
  { "xra01",   0x01020000, 2, BUS_SPI|BUS_WRITE},
  { "xra23",   0x01030000, 3, BUS_SPI|BUS_WRITE},
  { "lmk",     0x02000000, 0, BUS_SPI|BUS_READ|BUS_WRITE},
  { "sy",      0x02010000, 0, BUS_SPI|BUS_WRITE},
  { "dac",     0x03000000, 0, BUS_SPI|BUS_WRITE},
  { "xratrig", 0x03010000, 0, BUS_SPI|BUS_WRITE},
  { "tmp102",  0x01040048, 0, BUS_I2C},
  { "eeprom",  0x01010051, 1, BUS_I2C},
  { NULL, 0}
};

struct adc3112_reg
{
  int bmov;
  int base;
  int sign;
  int serial;
  int gain;
  int ttim;
} 
adc3112_reg[NUM_FMC];

struct adc3112_sign
{
  char board_name[8];   /*  0x00  [0] */
  char serial[4];       /*  0x08  [8] */
  char version[8];      /*  0x0c  [12] */
  char revision[2];     /*  0x14  [20] */
  char rsv[6];          /*  0x16  [22] */
  char test_date[8];    /*  0x1c  [28] */
  char calib_date[8];   /*  0x24  [36] */
  char itl_corr[4][8];  /*  0x2c  [44] */
  char pad[176];        /*  0x4c  [76] */
  int cks;              /*  0x00 [252] */
} adc3112_sign;         /* 0x100 [256] */
struct adc3112_acq_res
{
  struct adc3112_acq_chan
  {
    uint tot;
    short min;
    short max;
    float mean;
    float sig;
    int off_min;
    int off_max;
  } chan[ADC_NUM_CHAN];
};

struct adc3112_calib_ctl
{
  int reg_ttim_cal;
  int reg_acq_csr; 
  int reg_adc_serial; 
  struct adc3112_calib_chan
  {
    int chan;
    int delay;
    int ttim[CAL_BIT_NUM];
    int err_cnt[CAL_BIT_NUM][CAL_STEP_NUM+1];
    int cal_res[CAL_STEP_NUM+1];
    int delta[CAL_BIT_NUM];
    int hold_time;
    int set_time;
    char *data_buf;
  } chan[ADC_NUM_CHAN];
} adc3112_calib_ctl[NUM_FMC];

struct adc3112_itl_ctl
{
  int reg_itl_gain;
  int reg_acq_csr; 
  struct adc3112_itl_chan
  {
    int chan;
    int gain;
    int offset;
    char *data_buf;
  } chan[ADC_NUM_CHAN];
  struct adc3112_acq_res acq_res;
} adc3112_itl_ctl[NUM_FMC];

int adc3112_init_flag[NUM_FMC] = {0,0};
int adc3112_verbose_flag = 0;
